{
  "person": {
    "role": "Computer Science Graduate Student"
  },
  "home": {
    "label": "Home",
    "title": "{name}'s Portfolio",
    "description": "Portfolio website showcasing my work as a {role}",
    "headline": "Graphics Engineer and AI Enthusiast",
    "subline": "I'm Shaoxuan Yin, a Computer Science graduate student at Linköping University, passionate about computer graphics and AI"
  },
  "about": {
    "label": "About",
    "title": "About me",
    "description": "Meet {name}, {role} from {location}",
    "intro": {
      "title": "Introduction",
      "description": "Hey! In 2024, I got really inspired by the concept of first principles thinking - you know, breaking things down to their fundamental truths and building up from there. Instead of just following tutorials or waiting to join the perfect team, I started building my own projects from scratch. Right now, I'm deep into graphics and AI, working on everything from neural rendering to game development. What really drives me? I'm actually super fascinated by how humans and machines might work together in the future - maybe even merge one day (yeah, I know it sounds sci-fi, but that's what gets me excited!). Each project I take on, whether it's training AI models or simulating physics, is like a small step toward understanding how we might get there. It's challenging and sometimes feels crazy ambitious, but hey, that's what makes it fun! I'm Shaoxuan Yin, a Computer Science graduate student at Linköping University, passionate about computer graphics and AI."
    },
    "work": {
      "title": "Work Experience",
      "experiences": {
        "Guoyao": {
          "timeframe": "August 2022 - September 2022",
          "role": "C++ Development Engineer Intern",
          "achievements": "Implemented user interfaces and part of an interactive 3D terrain rendering system using Qt framework and OpenGL;Participated in custom network protocol development based on socket communication."
        },
        "GienTech": {
          "timeframe": "July 2021 - August 2021",
          "role": "Software Engineer Intern",
          "achievements": "Developed a WeChat Mini Program for an online farmer's market;Implemented microservices using Spring Cloud and optimized database queries."
        }
      }
    },
    "studies": {
      "title": "Education",
      "institutions": {
        "Linköping University": {
          "description": "Master of Science in Computer Science"
        },
        "Beijing Information Science & Technology University": {
          "description": "Bachelor of Engineering in Computer Science and Technology"
        }
      }
    },
    "technical": {
      "title": "Technical skills",
      "skills": {
        "Graphics": {
          "description": "Proficient in OpenGL, CUDA, Three.js, and experience with Unreal Engine and Unity"
        },
        "Programming": {
          "description": "C++, Python, Java, JavaScript, Shell scripting, and various development tools"
        }
      }
    }
  },
  "blog": {
    "label": "Blog",
    "title": "Writing about graphics and AI...(Most on X)",
    "description": "Read what {name} has been up to recently"
  },
  "work": {
    "label": "Projects",
    "title": "My projects",
    "description": "Graphics and AI projects by {name}"
  },
  "projectCard": {
    "label": "Read Case Study"
  },
  "github": {
    "label": "GitHub",
    "title": "GitHub"
  }
}
